In [1]:
import pandas as pd

# Creating a sample DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Emily'],
    'Age': [25, 30, 35, 40, 45],
    'Score': [85, 90, 75, 80, 95]
}

df = pd.DataFrame(data)

print("Original DataFrame:")
print(df)

Original DataFrame:
      Name  Age  Score
0    Alice   25     85
1      Bob   30     90
2  Charlie   35     75
3    David   40     80
4    Emily   45     95

In [2]:
# Using .query() method to filter rows
filtered_df = df.query('Age > 30 and Score > 80')

print("\nFiltered DataFrame:")
print(filtered_df)

Filtered DataFrame:
    Name  Age  Score
4  Emily   45     95

In [3]:
died = ['Bob', 'David']

In [5]:
df.query("Name not in @died")

      Name  Age  Score
0    Alice   25     85
2  Charlie   35     75
4    Emily   45     95

In [7]:
df[~df["Name"].isin(died)]

      Name  Age  Score
0    Alice   25     85
2  Charlie   35     75
4    Emily   45     95